ref
    https://github.com/aQuaYi/CSAPP3E/blob/master/homework/03/3.72.md

A.
    s2 = s1 - [(8n + 30) & -16]
    或者说 (8n + 30) 要求是16的倍数.

n
    奇 s2 = s1 - 8(n+3)
    偶 s2 = s1 - 8(n+2)

B.
    p = (s2 + 15) & -16
    %rsp + 15 找到第一个大于等于16的倍数

C.
    我们重新梳理一遍

    s2 = s1 - 8(n + 3) 当 n 为奇数
    s2 = s1 - 8(n + 2) 当 n 为偶数

    e1 = s1 - p - 8n
    e2 = p - s2

    p = (s2 + 15) - (s2 + 15) % 16

    进行推导
        e2 = p - s2 = 15 - (s2 + 15) % 16

    e1 + e2 = s1 - p - 8n + p - s2
            = s1 - s2 - 8n
            = 8(3|2)  表示奇数|偶数选择其中一个
    e1 + e2 = 24 当 n 为奇数
    e1 + e2 = 16 当 n 为偶数

    另
        e1 = 24 - e2 此时 n 为奇数
           = 24 - 15 + (s2 + 15) % 16
           = 9 + (s2 + 15) % 16
           = 9 + (s1 - 8(n + 3) + 15) % 16
           = 9 + (s1 - 8n - 9) % 16
        另 n = 2k - 1
           = 9 + (s1 - 16k - 1) % 16
           = 9 + (s1 - 1) % 16
        当 s1 % 16 = 1，此时 e1 = 9
        当 s1 % 16 = 0，此时 e1 = 24

    另
        e1 = 16 - e2 此时 n 为偶数
           = 16 - 15 + (s2 + 15) % 16
           = 1 + (s1 - 8n - 16 + 15) % 16
           = 1 + (s1 - 8n - 1) % 16
        另 n = 2k
           = 1 + (s1 - 16k - 1) % 16
           = 1 + (s1 - 1) % 16
        当 s1 % 16 = 1，此时 e1 = 1
        当 s1 % 16 = 0，此时 e1 = 16

    综上
        当 n 为偶数，s1 % 16 = 1，此时 e1_min = 1
        当 n 为奇数，s1 % 16 = 0，此时 e1_max = 24

D.
P 是 16字节对齐
s2 是容下 8n 大小空间的16的倍数

