A.
懒得敲字符画了
ref: https://dreamanddead.github.io/CSAPP-3e-Solutions/chapter3/3.67/
     104  +------------------+
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
      64  +------------------+ <-- %rdi
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
      32  +------------------+
          |         z        |
      24  +------------------+
          |        &z        |
      16  +------------------+
          |         y        |
       8  +------------------+
          |         x        |
       0  +------------------+ <-- %rsp


B.
     传递 %rsp + 64

C.
     通过 %rdi + offset 来访问

D.
     由 eval 传递的 %rsp + 64 的位置存放数据(存放r的字段)

E.
     注意 call 时会 push 一个返回地址。

     104  +------------------+
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
          |                  |
      88  +------------------+
          |        z         |
      80  +------------------+
          |        x         |
      72  +------------------+
          |        y         |
      64  +------------------+ <-- %rdi(eval pass in)
          |                  |  \
          |                  |   -- %rax(process pass out)
          |                  |
          |                  |
          |                  |
          |                  |
      32  +------------------+
          |         z        |
      24  +------------------+
          |        &z        |
      16  +------------------+
          |         y        |
       8  +------------------+
          |         x        |
       0  +------------------+ <-- %rsp in eval
          |                  |
      -8  +------------------+ <-- %rsp in process

F.
     调用者分配一定的栈空间后，把栈指针 %rsp + offset 作为地址，参数传递过去
     被调用者使用调用者传递的地址，将数据存储在该区域里，最后返回该地址